Repository: mozilla-l10n/mt-training-data
Catalog: odk/odk_pontoon.tmx
Source language: en_us
Languages: odk

source: Why does this matter?
odk: ها معاملا ڪان هُلا؟

source: Why we built this Spontaneous Speech prototype
odk: اَمهِين ها ڪوڙِي تقرِير پروٽون ٽائِيپ ڪان ٺاهلا

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
odk: پروفائِيلا سُون تمهِين آپڪا جڪو بِي ڪام ڪرا ڇَوا اوهچ ڏيک سِگھا ڇَوا ائُون آوازا هاڙي ڊيٽائي ۾ مدد ڪرڻي هاڙِا چِي هيڪِي برادرِي سُون ڳنڍ سِگھا ڇَوا۔

source: Wixarika
odk: وگزارِيڪا

source: Wixárika
odk: وِگزارِيڪا

source: Wolof
odk: وولوفِي

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
odk: ڪا تمهِين عرض ڪرڻ چاهوا ڇَوا تہ آپڪي آوازا چِي رڪارڊنگ بِي ڊِيلِيٽ ڪلِي جا، يان بڙي ڪا تمهان نُون ڊيٽا سيٽا ۾ ميلهڻ بڻَي ڇَي؟

source: Write
odk: لِکا

source: Write down exactly what the person said, including placeholder words like 'um', or 'errr'.
odk: بِلڪُل اُونهچ لِکا جڪو ماڻسَي ڪيهلَي، چالاڪ پليس هولڊر لفظ جُون ‘um‘ يان بڙِ ’errr‘۔

source: Write down what you hear the person saying here
odk: اِٺي لِکا تہ تمهِين اي ماڻسا نُون ڪا ڪيهٿا سُڻا ڇَوا۔

source: Write options menu
odk: اختيار ائُون مينيُون لِکا

source: Xhosa
odk: زهوسِي

source: Xitsonga
odk: زٽسونگِي

source: y
odk: وائي

source: Y
odk: وائي

source: Yaqui
odk: ياقُوئِي

source: Yes
odk: هَوي

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
odk: هوي، مُنُون اي ميلا موڪلا۔ مين ڪامن وائِيس پروجيڪٽا چي باري ۾ ڄاڻ حاصل ڪرڻ چاهوين ڇَين۔

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
odk: جِي هُوي، مُنُون اِي ميل ڪرا، مين جي ٻولِي چِي ترقِي چي باري ۾ ڪامن وائِيسا پر هر خبر راکڻ چاهوَين ڇَين۔

source: Yiddish
odk: يدش

source: Yoruba
odk: يورُوبائِي

source: You
odk: تمهِين

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
odk: تمهِين ڊائُون لوڊ ڪرڻي هاڙي ڇوا <size>{ $size }GB</size> اُگتي بڌا؟

source: You are prepared to initiate a download of <b>{ $size }</b>
odk: </b> { $size } ڊائُون لوڊ شرُوع ڪرڻي چي ڪاڻ تمهِين تيار ڇَوا۔<b>

source: You can add sentences on the <writePageLink>Write page</writePageLink> or review sentences on the <reviewPageLink>Review page</reviewPageLink>.
odk: تمهِين <writePageLink>لِکڻي هاڙي صُفحي</writePageLink> پرجُملي شامل ڪر سِگھا ڇوا، يان <reviewPageLink> پر جائِزا گيهڻي هاڙي صُفحي</reviewPageLink> پرجُملان چا جائِزا گيه سِگھا ڇوا۔

source: You can also copy and paste the direct URLs into your favorite download manager. They will expire in 12 hours, but you can come back to this page to generate new ones any time.
odk: آپڪِي آپا نُون بڻڻي هاڙِي ڊائُون لوڊ مينجرا ۾ ويهچ 12 URLs تمهِين آپ نقتل ڪر سِگھا ڇَوا جڪو سِڌِي ڪلاڪا ۾ ختم هُتِي جاهِي، پَر تمهِين ڪسِي بِي مهلِي نَوين ٺاهوڻي چي ڪاڻ اي صِفحي پر پُوٺي جا سِگھا ڇَوا۔

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
odk: تمهِين شارٽ ڪٽ ڪِي بورڊ اِستعمال ڪر سِگھا ڇَوا: { sc-review-form-button-approve-shortcut } رد ڪرڻي ڪاڻ { sc-review-form-button-skip-shortcut } منظُور ڪرڻي ڪاڻ { sc-review-form-button-reject-shortcut }

source: You can choose to make your username public or anonymous.
odk: آپڪا يُوزر، نالَي يان بڙي گُمنام ڪرڻي ڪاڻ تمهِين چُونڊ سِگھا ڇَوا۔

source: You can find <examplePromptsLink>120 example prompts in this sheet.</examplePromptsLink>
odk: تمهِين جي شِيٽِي ۾ <examplePromptsLink> 120 مثالان چي حوالي سوڌ سِگھا ڇَوا </examplePromptsLink>۔

source: You can go to the <datasetsPage>datasets page</datasetsPage>, select the version and language(s) you want, and download it! The files have <metadataLink>associated metadata</metadataLink>, such as demographic information and validation data. You’ll need to provide an email address to download the dataset.
odk: تمهِين<datasetsPage>ڊيٽا سيٽ صفحي </datasetsPage> پر جا سِگھا ڇَوا۔ جڪو تمهِين چاهوا ڇَوا اوهچ ورجن ائُون ٻولِي چُونڊا، فائيلان ۾ <metadataLink>بِڇڙوڙا ميٽا ڊيٽا</metadataLink> ڇَي مثال، ڊيموگرافڪ ڄاڻ ائُون پڪا ڪرڻي هاڙا ڊيٽا۔ تمهان نُون ڊيٽا سيٽ ڊائُون لوڊ ڪرڻي چي ڪاڻ هيڪ اِي ميل ڊيٽا اِڊريس ڏِيئڻي چِي ضرُورت پڙهِي۔ ۔

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
odk: تمهِين مدد ڪر سِگھا ڇَوا هيڪ متنوع (اڪيلا﻿)، اوپن سورس ڊيٽاسيٽ ٺاهوَڻي چي ڪاڻ هيڪ ڪامن وائِيس پروفائِيل ٺاهوا ائُون آپڪا آواز شامل ڪرا۔

source: You can meet others in the Mozilla language communities by joining <discordLink>Discord</discordLink> or <discourseLink>Discourse</discourseLink> for topical conversations, or <matrixLink>Matrix</matrixLink> for quick advice.
odk: تمهِين موزيلا چي ٻولِي هاڙِِيان برادرِيان ۾ ڏُوجان سُون مل سگها ڇوا <discordLink>Discord</discordLink> يا <discourseLink>Discourse</discourseLink> پر شامل هُتِي موضوعاتي باتا ڪرڻي ڪاڻ، يان تڪڙي صلاح مشوري ڪاڻ <matrixLink>Matrix</matrixLink> پر.

source: You cannot add multiple sentences for a single submission
odk: تمهِين آپ جمع ڪراوَڻي چي ڪاڻ هيڪ چُونڊوڙا جُملا شامل ڪونهِي ڪر سِگھا ڇَوا

source: You cannot request your recordings while another request is already in progress.
odk: تمهِين آپڪِي رڪارڊنگِي چِي درخواست ڪونهِي ڪر سِگھا ڇَوا جِڏ تہ ڏُوجِي درخواست اڳ ۾ ئِي پلِي ڇَي۔

source: You can request a new takeout of your recordings every { $days } days.
odk: تمهِين هر ڏِيها پر آپڪِي رڪارڊنگِي چِي نَوِين ٽيڪ آئُوٽِي چِي درخواست { $days } ڏي سِگھا ڇَوا۔

source: You can run events to help people contribute. It’s easier than you think. You could do it online with a videoconferencing tool, or in person if it’s safe. <eventTemplate>Check out our templates and resources for running events</eventTemplate>.
odk: تمهِين ماڻسان چِي مدد ڪرڻي چي ڪاڻ واقعيي هلا سِگھا ڇَوا۔ اوهچ تمچي سوچڻي کن بڌِيڪ سولڙا ڇَي۔ تمهِين اُونهچ ڪر سِگھا ڇَوا، آنلائن وِيڊيوز ائُون ڪانفرنس ٽُولا سُون، يان بڙي ذاتِي نمُوني اوهچ محفُوظ ڇَي </eventTemplate> چالتان واقعِيا چي ڪاڻ امچي ٽيمپليٽ ائُون وسِيلي چيڪ ڪرا۔<eventTemplate>

source: You can <sentenceCollectorLinkAdd>add small numbers of sentences</sentenceCollectorLinkAdd>, or you can do <bulkImportDocsLink>bulk imports using Github</bulkImportDocsLink>. Remember that sentences need to be <licenseLink>CC0 (or public domain)</licenseLink>, or you can write your own.
odk: تمهِين </sentenceCollectorLinkAdd> جملان چي ڌاري انگ شامل ڪر سِگھا ڇوا۔ <sentenceCollectorLinkAdd> يان بڙي تمهِين <bulkImportDocsLink> Github اِستعمال ڪتِي بڌِيڪ گھڻي امپورٽ ڪر سِگھا ڇوا۔ </bulkImportDocsLink> ياد راکا تہ جملي <licenseLink> CC0 (يان عوامِي ڊومين)</licenseLink> هُوَڻ کپِي، يان بڙي تمهِين آپڪَي بِي لِک سِگھا ڇَوا

source: You can use the <scraperLink>Sentence extractor</scraperLink> to leverage short sentences from Wikipedia.
odk: تمهِين <scraperLink> Sentence extractor</scraperLink> نُون اِستعمال ڪتِي وِڪِيپِيڊيا مُون ڌاران ڌاران جُملان نُون حاصل ڪر سِگھا ڇَوا۔

source: You check whether the transcription matches the audio
odk: تمهِين چڪاس ڪرا تہ ها نقل آڊيوئِي سُون سُٺي لفظ اِستعمال ڪرَي ڇَي۔

source: You could include the website, e.g "Common Voice - https://commonvoice.mozilla.org/"
odk: تمهِين ويب سائِيٽ شامل ڪر سِگھا ڇَوا، مثال ”ڪامن وائِيس https://commonvoice.mozilla.org/“

source: You could use academic referencing style, e.g Harvard style "Mozilla (2021) Common Voice. Available at https://commonvoice.mozilla.org/ (Accessed: 15th September 2021)"
odk: تمهِين اِستعمال ڪر سِگھا ڇَوا اڪيڊمِي ريفرنسنگ اسلوب، مثال هارورڊ انداز (”ڪامن وائِيس موزِيلا (2021) پر موجُود ڇَي: 15 سيپٽمبر 2021 https://commonvoice.mozilla.org/ )۔

source: You could use social media platforms to get the message out. Share posts that explain why it matters, and get in touch with other people talking about issues like language rights, voice AI, or bias in tech. See more advice on <campaignLink>running a social campaign, including content you can re-use</campaignLink>.
odk: تمهِين نِياپا گيهڻي چي ڪاڻ سوشل ميڊيا پليٽ فارم اِستعمال ڪر سِگھا ڇَوا۔ پوسٽا شيئر ڪرا، جڪو وضاحت ڪري هِتِيا تہ اُونهچ ڪان لازمِي ڇَي، ائُون ڏُوجان ماڻسان سُون رابطا ڪرا جڪو مسئلان چي باري ۾ ٻولي هِتين پلين۔ سوشل مهم هلاوَڻ، جڪا ۾ مواد <campaignLink> يان بڙي ٽيڪنالاجِي ۾ تعشب، بڌِيڪ صلاح ڏيکا، AI مثال ٻولِي چي حقان، تمهِين آواز بڙتِي اِستعمال ڪر سِگھا </campaignLink> ڇَوا۔

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
odk: تمهِين ڪو بِي ٻولِي ڪونهِي چُونڊلِي ڇَي۔ مهربانِي ڪتِي ٻولِيا چُونڊڻي چي ڪاڻ <profileLink> پروفائِلا ڏِسِين جاوا</profileLink>۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
odk: تمهِين جمع ڪراوَڻي چي ڪاڻ اي صفعي چِي حدِي تاڻِين پُجتِي گيلي ڇَوا۔ مهربانِي ڪتِي ڏُوجا جُملا جمع ڪرڻي کن پيهڻُون { $retryLimit } منٽ اِنتظار ڪرا۔ اِنتظار ڪرڻي چي ڪاڻ تمچِي مهربانِي۔

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
odk: تمهِين اي صفعي ۾ جمع ڪراوَڻي چِي حدِي تاڻِين پُجتِي گيلي ڇَوا۔ ڏُوجا جُملا جمع ڪرڻي کن پيهڻُون مهربانِي ڪتِي { $retryLimit } سيڪنڊ اِنتظار ڪرا۔ اِنتظار ڪرڻي چي ڪاڻ تمچِي مهربانِي۔

source: You have unsaved changes on this page. If you change the locale, your changes will not be saved. Are you sure you want to change the locale?
odk: تمهان کن اي صفحي پر غير محفُوظ تبدِيلِيا هِتِيا۔ جي تمهِين جاءِ مٽاوا ڇَوا تہ تمچِيا تبدِيلِيا محفُوظ ڪونهِي هُوَس۔ ڪا تمهِين سچاڻِيُون بِي جاءِ مٽاوَڻ چاهوا ڇَوا؟

source: You have unsaved changes on this page. If you leave this page, your changes will not be saved. Are you sure you want to leave this page?
odk: تمهان کن اي صفحي پر غير محفُوظ تبدِيلِيا هِتِيا۔ جي تمهِين ها صفحا ڇوڙتِي ڏِيا ڇَوا تہ تمچِيا تبدلِيا محفُوظ ڪونهِي هُوِي۔ ڪا تمهِين پڪ ها صفحا ڇوڙڻ چاهوا ڇَوا؟

source: You might also want to consider spanning different contexts and domains.
odk: تمهان نُون مٽ مٽ سياق و سباق ائُون ڊومينزا نُون کِنڊيرڻي پر بِي غور ڪرڻ کپَي۔

source: You must allow microphone access.
odk: تمهان نُون مائِيڪروفونا تاڻِين پُجڻي چِي موڪل ڏِِيئڻ کپَي

source: You need to be able to hear every word of the recording. We want machine learning algorithms to be able to handle a variety of background noise, and even relatively loud noises or quiet background music can be accepted provided that they don’t prevent you from hearing the entirety of the text. Crackles or ‘breaking up’ that prevent you hearing the text means you should reject the clip.
odk: تمهِين ڪارڊنگِي چا هر لفظ سُڻڻي چي قابل هُوَڻ کپا۔ اَمهِين چاهُون ڇَئُون تہ لرننگ الگورتهم مختلف پس منظرا چي لُڙا نُون سنڀالڻي چي قابل هُتِي جا، ائُون تيز آواز يان بڙي خاموش پس منظرا چِي موسييقِي نُون قبُول ڪر سِگھَي ڇَي، پر شرط ها ڇَي جو ويهچ تمهان نُون متن سُڻڻي کن پورَي نہ جھلس۔ ڇِڪڻ يان بڙي ’بريڪنگ اپ‘ جڪو تمهان نُون متن سُڻڻي جھلي هِتي، مطلب تہ تمهِين ڪِلپا نُون رد ڪر سِگھا ڇَوا۔

source: Your accent is the way you pronounce words. It can be shaped by where you have lived, which other languages you speak and lots of other factors. You can share any information you feel is relevant here.
odk: تمچا اُچارا اوهچ نمُونا ڇَي جڪو تهِين لفظان چي اُچار ڪاڍا ڇَوا۔ اونهُون ترتِيب ڏي سِگھَي ڇَي تہ تمهِين ڪِٺي ريهوا ڇَوا، تمهِين ڪِسِيا ٻولِيا ٻولا ڇَوا ائُون گھڻي ئِي عنصر۔ تمهِين ڪو بِي ڄاڻِي ۾ ڀائِيچارا ڪر سِگھا ڇَوا جڪو تمهِين محسُوس ڪرا تہ اِٺي ڳنڍوڙَي ڇَي۔

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
odk: تمچي گمنام آوازا چِي رڪارڊنگ ڪامن وائِيس ڊيٽا سيٽا ۾ هُوِي۔ هيڪ چڪر تمهِين آپڪي پروفائِيلا نُون کتِي ڇوڙا، تمهِين اَمهين ڊيٽا سيٽا مُون رڪارڊنگ هٽاوَڻي چِي درخواست ڏِيئڻي چي قابِل ڪونهِي هُوا۔

source: Your daily goal has been created
odk: تمچا ڏِيهاڙِي هاڙا مقصد ٺاهلا گيلا ڇَي

source: Your dataset is downloading!
odk: تمچا ڊيٽاسيٽ ڊائُون لوڊ هُوَي ڇَي پلا

source: Your download has started.
odk: تمچِي ڊائون لوڊنگ شرُوع هُتِي گيلِي ڇَي

source: You’re contributing to a target segment
odk: تمهِين هيڪي هدفا هاڙي حِصي ۾ حِصا گيهوا ڇوا پلي

source: You’re contributing to our first target segment
odk: تمهِين امچي پيهڻي هدفا هاڙي حِصي ۾ حِصا گيهوا ڇوا پلي

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
odk: تمهِِن اِمهين اِي ميلا حاصل ڪر حاصل ڪر سِگھا ڇَوا﻿<bold> يان نہ </bold>، جُون مقصدا چي بارِي ۾ ياد ڏِراوَڻي هاڙِيا باتا، مانڇِي اُگتِي بڌڻي چي باري ۾ نوِيا باتا ائُون ڪامن وائِيسا چي باري ۾ نيُوزليٽر۔

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
odk: تمهِين اِمهين اِي ميلا حاصل ڪر سِگھا ڇَوا، جُون مقصدا چي بارِي ۾ ياد ڏِراوَڻي هاڙِيا باتا، مانڇِي اُگتِي بڌڻي چي باري ۾ نوِيا باتا ائُون ڪامن وائِيسا چي باري ۾ نيُوزليٽر۔

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
odk: تمهِين صفا تيز جاوا ڇَوا چلي۔ مهربانِي ڪتِي ٿوڪڙي ساهِي پٽا ائُون جُملي چا جائِزا گيهوا ائُون پڪ ڪرا تہ اوهچ صحِيح ڇَي

source: You're helping Common Voice reach our daily sentence goals!
odk: تمهِين ڪامن وائِيسا ۾ جُملان چي مقصدان ۾ پُجڻي تاڻِين امچِي هر روز مدد ڪرا ڇَوا۔

source: Your email address
odk: تمچِي اِي ميل پٽا

source: You respond or reply to it as naturally as you can
odk: تمهِين اينهُون قُدرتِي نمُوني سُون ورندِي يان بڙي جواب ڏِيا۔

source: Your files are being assembled. Please check again later.
odk: تمچِيا فائِيلا ڀيڙِيا ڪلِيا پلِيا جائي هِتِيا۔ مهربانِي ڪتِي پڇي بڙي بڙتِي چيڪ ڪرا۔

source: Your Languages
odk: تمچِيا ٻولِيا

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
odk: تمچِي ٻولِي چا ڍنگ شايد ڪِلپس خالِي ڇَي، جي اگر تمهان نُون سُٺَي لاگَي تہ سينٽگ مٽاتِي ٻولِي چي ڏُوجي جُملي ڏيک سِگھا ڇَوا۔

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
odk: هُو سِگھَي ڇَي تہ تمچِي ٻولِي چي لهجي ۾ جملي ختم هُتِي گيلي هِتي۔ جي اگر تمهان صحِيح لاگَي تہ تمهِين سيٽنگز مٽاتِي آپڪِي ٻولِي چي ڏُوجي جملي ڏيک سِگھا ڇَوا۔

source: Your username and email will not be associated with the published data.
odk: تمڇَي رُگَي نان ائُون اِي ميل شايع هُئوڙِي ڊيٽائِي سُون ڳنڍوڙِي ڪونهِي هُوَي۔

source: Your weekly goal has been created
odk: تمچا هفتي هاڙا مقصد ٺاهلا گيلا ڇَي

source: You should receive an email from our Community Manager explaining the steps to get your language added to Common Voice
odk: تمچِي ٻولِي نُون ڪامن وائِيسا ۾ شامل ڪرڻي ڪاڻ هيڪ قدم تمهان نُون جلدِي وضاحت ڪرڻي هاڙِي هيڪ اِي ميل حاصل ڪرڻ کپَي۔

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
odk: تمهِين ڪامن وائِيسا <goalPercentage> ۾ روزانِي رڪارڊنگ هاڙي { $goalValue }هيڪي هدفا ۾ حِصا گيهڻي ۾ امچِي </goalPercentage> مدد ڪلِي

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
odk: ڪامن وائِيسا ۾ تمهِين <goalPercentage> امچِي راوزاني تصدِيقِي هاڙي هدفا چا</goalPercentage> حِصا گيهڻي ۾ امچِي مدد { $goalValue } ڪلِي۔

source: You've successfully signed up for contributing to { $language }. Thank you.
odk: { $language } تمهِين ڪاميابِي سُون سائِين اَپ ڪلَي ڇَي، مدد ڪرڻي چي ڪاڻ مهربانِي۔

source: You want to join the Common Voice mailing list
odk: ڪامن وائِيس ميلنگ لسٽِي ۾ تمهِين شامل هُوَڻ چاهوا ڇَوا

source: You write down what you hear in the audio clips
odk: آڊيو ڪلپسا ۾ جڪو ڪهِين تمهِين سُڻا ڇَوا اُونهچ لِکا۔

source: Zaza
odk: زازا

source: Zip #{ $offset } of { $total }
odk: زِِپ #{ $offset } آف { $total }

source: Zulu
odk: زُولُو

source: account recovery key
odk: اڪائُونٽ بڙتِي حاصل ڪرڻي چِي چاٻِي

source: add-on
odk: ايڊ آن

source: alternate text
odk: متبادل متن

source: attack
odk: حملا

source: attacker
odk: حملا ڪرڻي هاڙا

source: Attack Site
odk: حملي ڪرڻي هاڙِي سائِيٽ

source: attendee
odk: شرِيڪ هُوڻي هاڙا

source: authenticate
odk: تصدِيق ڪرڻ

source: authenticated
odk: تصدِيق ڪروڙا

source: authentication code
odk: تصدِيق ڪروڙا ڪوڊ

source: autoplay
odk: آپڪي آپ چالڻي هاڙا

source: backup authentication code
odk: تصدِيق ڪروڙي ڪوڊا چا بيڪ اپ

source: bookmark
odk: بُڪ مارڪ

source: breakpoint
odk: روڪڻي چِي جاءِ

source: Bug report
odk: بَگ رپورٽ

source: certificate authority
odk: سرٽيفڪيٽ جارِي ڪرڻي هاڙا ادارا

source: cipher
odk: سائِيفَر

source: clipboard
odk: ڪيلپ بورڊ

source: colorway
odk: رنگا چِي ترتِيب

source: confirmation code
odk: پڪ ڪرڻي هاڙا ڪوڊ

source: context
odk: سياق و سباق

source: cookie banner
odk: ڪُوڪِي نوٽيسا هاڙا بينر

source: corrupt
odk: خراب

source: corrupted
odk: خراب هُوئوڙا

source: crash
odk: اوچتَي بند هُوَڻ

source: cross-site tracking cookie
odk: مختلف ويب سائيٽان چِي جانڇ ڪرڻي هاڙِي ڪُوڪِي

source: cryptominer
odk: ڪرپٽو ڪرنسِي کوٽڻي هاڙا اوزار

source: cryptomining
odk: ڪرپٽو ڪرنسِي ٺاهوَڻ

source: debug
odk: خرابِي چِي اوڙکاند ائُون صحِيح ڪرڻ

source: deceptive site
odk: ٺڳڻي هاڙِي ويب سائِيٽ

source: decode
odk: ڪوڊ سمجهڻ يا ترجُما ڪرڻ

source: decryption
odk: انڪرپٽ ڊيٽا پڙهڻي چا عمل

source: disinformation
odk: غلط معلومات

source: distrust
odk: بي اعتمادي

source: email mask
odk: اي ميل ماسڪ

source: enable
odk: اختيار ڏِيڻ

source: encode
odk: ڪوڊا ۾ لِکڻ

source: encrypt
odk: ڪوڊا ۾ مٽاوڻ

source: encryption
odk: ڪوڊا ۾ مٽاوڻي چا عمل

source: end user
odk: اِستعمال ڪرڻي هاڙا

source: Enhanced Tracking Protection
odk: ٽريڪينگِي چي خلاف بڌِيڪ بچا

source: extension
odk: ايڪسٽينشن

source: fingerprinter
odk: فنگر پرنٽر

source: fingerprinting
odk: فنگر پرنٽينگ

source: Firefox View
odk: فائِرفوڪسا چا ڏيک

source: grassroots
odk: بُنيادِي درجي

source: home page
odk: شرُوعاتِي صِفحا

source: import
odk: امپورٽ

source: independent browser
odk: خُودمُختيار برائُوزر

source: innovations
odk: نَوِيان باتا

source: insecure
odk: غير محفُوظ

source: installation
odk: اِنسٽال ڪرڻي چا عمل

source: Issue
odk: مسئلا

source: Legacy extension
odk: پُراڻِي ايڪسٽينشن

source: MDN
odk: موزيلا ڊولپر نيٽورڪ

source: misinformation
odk: غلط معلُومات

source: native
odk: اصل رهاڪُو

source: net neutrality
odk: اِنٽرنيٽا پر برابرِي چَي حق

source: nonprofit
odk: نفع نہ گيهڻي هاڙِي تنظِيم

source: non-profit
odk: نفع نہ گيهڻي هاڙِي تنظِيم

source: open source
odk: اوپن سورس

source: override
odk: مٿُون لکڻ

source: phone number mask
odk: فون نمبرماسڪ

source: pop-up
odk: اوچتَي ظاهر هُوَڻي هاڙِي ونڊو

source: preference
odk: ترجيح

source: Privacy Notice
odk: زاتِي معلُوماتِي چا نوٽس

source: release
odk: جارِي ڪرڻ

source: report
odk: رِپورٽ

source: restricted site
odk: پابندِي لاگوڙِي سائِيٽ

source: revert
odk: واپس ڪرڻ،

source: Review checker
odk: نطرثانِي ڪرڻي هاڙَي اوزار

source: search suggestion
odk: سوڌڻي چي ڪاڻ صلاح

source: security keys
odk: حفاظت ڪرڻي هاڙِي چاٻِي

source: sensitive
odk: حساس

source: sidebar
odk: پاسي هاڙِي پٽِي

source: sign
odk: سهِي ڪرڻ

source: signer
odk: سهِي ڪرڻي هاڙَي ماڻس

source: sign in
odk: سائِين اِن

source: sign-in
odk: سائِين اِن

source: studies
odk: مُطالعہ

source: Terms of Service
odk: اِستعمال ڪرڻي چِي شرط

source: track
odk: پِيڇا ڪرڻ

source: trackers
odk: پِيڇا ڪرڻي هاڙي

source: Tracking Content
odk: ٽريڪ ڪرڻي هاڙا مواد

source: unencrypted
odk: بِنا ڪوڊ ڪروڙا

source: unresponsive
odk: جواب نہ ڏِيڻي هاڙا

source: unsafe
odk: غير محفُوظ

source: validate
odk: تصدِيق ڪرا

source: validity
odk: پڪا هُوَڻ

source: version
odk: نُسخا

source: Web Authentication
odk: ويب سائِيٽِي چِي تصدِيق
